"""
Quiz!!
1. 구구단 2단 출력
2. 2단 ~ 9단 모두 출력
3. 1 ~ 1000 사이의 11과 13의 공배수를 출력
    (그 개수도 출력)
4. 1 ~ 1000 까지의 홀수를 모두 더하면?

"""
print("========== 2단 ==========")
for a in range(1, 10):
    print(f"2 x {a} = {2*a}")

print("===================================================  구구단  =======================================================")
for a in range(2, 10):
    for b in range(1, 10):
        print(f"{a} x {b} = {a * b}", end = '  ')
    print("\n")

print("============================================== Quiz3 =================================================")
i = 0
for a in range(1, 1001):
    if (a % 11 == 0 and a % 13 == 0):
        print(a)
        i += 1
print(f"{i}개 입니다.")

print("============================================== Quiz4 =================================================")
print("                          < 1 ~ 1000 사이의 모든 홀수를 출력하고 그 합을 구하라. >  ")
sum = 0
for a in range(1, 501):
    i = (2*a - 1)
    print(i, end = ' ')
    sum += i
    if (i % 40 >= 39):
        print("\n")
print(f"1 ~ 1000 사이의 모든 홀수의 합은 {sum}입니다")








